docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокДіїЛіцензії</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адреса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБорг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПросроченийБоргТзОВ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Область</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Области</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВідділенняНП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Власний</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйСтатусКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАсортимета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КодыАсортимета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеТТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСайт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Геолокация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъмЗаМесяц</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТорговыйАгент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТорговыеАгенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовоеСообщение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанийВВайбере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактВайбер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейОтПоследнейПокупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПошуку</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КаналиПошуку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусДиалога</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокСесия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Борг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаботаСКлиентомЗапись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОновлення</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месенджер</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыМесендеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Маршруты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Асортимент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АсортиментПрезентацій</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Артикул</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>64</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРучнаяЗапись</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоцМережі</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Коментар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Посилання</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Мережа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидиСоцМереж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПосиланняВБраузері</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/InformationRegisters/НовоеСообщение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>НовоеСообщение</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Новое</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактыViber</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

docs/1c-export-mobile/MobileAgent/Catalogs/Контрагенты/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура УстановитьРежимВыбораФормы()
	ЭтаФорма.Элементы.Список.РежимВыбора = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	#Если МобильноеПриложениеКлиент Тогда 
		Элементы.ГрупиКолонокДесктоп.Видимость = Ложь;
		Элементы.ГруппаКолонокМобільний.Видимость = Истина;
	#КонецЕсли
	
	//#Если НЕ МобильноеПриложениеКлиент Тогда
	//	Для Каждого ГрЭл Из Элементы.ГрупиКолонокДесктоп.ПодчиненныеЭлементы Цикл 
	//		Для Каждого Эл Из ГрЭл.ПодчиненныеЭлементы Цикл 
	//			ШиринаЕл = ВосстановитьЗначениеНастроек("ДесктопШирина" + Эл.Имя);
	//			Если ШиринаЕл <> Неопределено Тогда 
	//				Эл.Ширина =  ШиринаЕл;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЦикла;
	//#КонецЕсли

	
	Если ЭтаФорма.ВладелецФормы <> Неопределено Тогда 
		УстановитьРежимВыбораФормы();
	КонецЕсли;
	
	//Элементы.ГруппаАдрес.Видимость = СвоїКлієнти;
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].Использование = СвоїКлієнти;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Использование = Истина;
	Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[0].Значение = ?(СвоїКлієнти, ТекущаяДата() - 30 * 24 * 3600, Неопределено);
	//Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Использование = Истина;
	//Список.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы[1].Значение =  ФільтрКлючовіСлова;

	Элементы.ФільтрПоБоргах.Видимость = СвоїКлієнти;
	ФільтрПоБоргах = 0;
	ФільтрПоБоргахПриИзменении(ФільтрПоБоргах); 
	
	Элементы.ГруппаИстория.Видимость		 = СвоїКлієнти;
	Элементы.ГруппаФільт.Видимость  		 = СвоїКлієнти;  
	Элементы.ФільтрТорговыйАгент.Видимость	 = Не СвоїКлієнти;
	
	//н = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("СправочникСсылка.КатегорииТТ"));
	//н.ВидСравнения
	
	
	ПодключитьОбработчикОжидания("ОтборазитьКнопкуНовыеУведомления", 15, Ложь);
	ПодключитьОбработчикОжидания("ОбновитьКоличествоНовых", 60, Ложь);
	
		

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоНовых()Экспорт
	
	СписокНовых = ПолучитьСписокНовых();
	Если СписокНовых = 0 Тогда
		Элементы.ФормаНовыеКомнды.Заголовок = "Нові";
		Элементы.ФормаНовыеКомнды.ЦветФона = Новый Цвет(255, 255, 255);
	Иначе
		Элементы.ФормаНовыеКомнды.Заголовок = "Нові - " + СписокНовых + "";
		Элементы.ФормаНовыеКомнды.ЦветФона = Новый Цвет(180, 255, 181);	
		//Элементы.ФормаНовыеКомнды.ЦветФона = Новый Цвет(180, 255, 181);	
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНовых()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактыViber.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.КонтактыViber КАК КонтактыViber
		|ГДЕ
		|	КонтактыViber.Новый";
	
	НовыеКлиенты = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовоеСообщение.Новое КАК Новое
		|ИЗ
		|	РегистрСведений.НовоеСообщение КАК НовоеСообщение
		|ГДЕ
		|	НовоеСообщение.Новое
		|	И НовоеСообщение.Контакт.Контрагент = &Контрагент";
	
	Запрос.УстановитьПараметр("Контрагент", Справочники.Контрагенты.ПустаяСсылка());
	
	НовыеСообщения = Запрос.Выполнить().Выгрузить();
		
	Возврат НовыеКлиенты.Количество(); 
	
КонецФункции	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Свойство("СвоїКлієнти", СвоїКлієнти) Тогда 
		СвоїКлієнти = Ложь;
	КонецЕсли;

	Если Не СвоїКлієнти Тогда
		//УсловноеОформление.Элементы.Очистить();
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы[1].Использование = Ложь;
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы[2].Использование = Ложь;
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы[3].Использование = Ложь;
		Список.КомпоновщикНастроек.Настройки.УсловноеОформление.Элементы[4].Использование = Ложь;
	КонецЕсли;	
	
    Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	
КонецПроцедуры


&НаКлиенте
Процедура ФільтрПоБоргахПриИзменении(Элемент)
	Если ФільтрПоБоргах = 0 Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Ложь;
	ИначеЕсли  ФільтрПоБоргах = 1 Тогда 

		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ИначеЕсли  ФільтрПоБоргах = 2 Тогда 

		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].Использование = Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[1].ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ФільтрСтатусПриИзменении(Элемент)
	Если ФільтрСтатус = "" Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование = Ложь;
	Иначе 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[2].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Подобно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[2].ПравоеЗначение	= ФільтрСтатус;		
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ФільтрМаршрутПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ФільтрМаршрут) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование = Ложь;
	Иначе  
		СписокКонтрагентовДляФильтра = ПолучитьСписокСылокКонтрагентовДляОтбораПоМаршрутам(ФільтрМаршрут);
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ПравоеЗначение	= СписокКонтрагентовДляФильтра;		
	КонецЕсли;


КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСылокКонтрагентовДляОтбораПоМаршрутам(ФільтрМаршрут)
	
	СписокКонтрагентовДляФильтра = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрагентыМаршруты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Контрагенты.Маршруты КАК КонтрагентыМаршруты
		|ГДЕ
		|	КонтрагентыМаршруты.Маршрут = &Маршрут
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрагентыМаршруты.Ссылка";
	
	Запрос.УстановитьПараметр("Маршрут", ФільтрМаршрут);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокКонтрагентовДляФильтра.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат СписокКонтрагентовДляФильтра;	
	
КонецФункции	

&НаКлиенте
Процедура ФільтрАсортиментПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ФільтрАсортимент) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование = Ложь;
	Иначе  
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[4].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[4].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[4].ПравоеЗначение	= ФільтрАсортимент;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФільтрКатегоріяТТПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ФільтрКатегоріяТТ) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[5].Использование = Ложь;
	Иначе  
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[5].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[5].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[5].ПравоеЗначение	= ФільтрКатегоріяТТ;		
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ФільтрСпосібДоставкиПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(ФільтрСпосібДоставки) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[6].Использование = Ложь;
	Иначе  
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[6].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[6].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[6].ПравоеЗначение	= ФільтрСпосібДоставки;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФільтрКлючовіСловаПриИзменении(Элемент)
	
	
	ОтборУсловие = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[9];
	ОтборУсловие.Элементы.Очистить();
ОтборУсловие.Использование = Истина;
	
	Если Не ЗначениеЗаполнено(ФільтрКлючовіСлова) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[7].Использование = Ложь;
		ОтборУсловие.Использование = Ложь;

	Иначе  
		
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[7].Использование = Истина;
		ОтборУсловие.Использование = Истина;
		
		Для Каждого Элемент Из ФільтрКлючовіСлова Цикл 
			Отбор = ОтборУсловие.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КлючовіСлова");
			Отбор.ПравоеЗначение = Элемент.Значение;
			Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Содержит;
			Отбор.Использование = Истина;
		КонецЦикла;
	КонецЕсли;

	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[10];
	Отбор.ПравоеЗначение = ФільтрКлючовіСлова.Количество();
	Отбор.Использование = ФільтрКлючовіСлова100;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАнализКлиентскойБазыНаСервере()
	ТабДокумент = Новый ТабличныйДокумент;
	
	ТаблицаСписка = СписокВКоллекциюЗначений();
	
	МассивКлиентов = ТаблицаСписка.ВыгрузитьКолонку("Ссылка");
	
	СписокКонтрагентов = Новый СписокЗначений;
	СписокКонтрагентов.ЗагрузитьЗначения(МассивКлиентов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТабКОнрагентв
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В(&Ссылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботаСКлиентом.Клиент КАК Клиент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РаботаСКлиентом.УИД_Записи) КАК КоличествоЗаписейПоКонтрагенту
		|ПОМЕСТИТЬ ТабРботкКлиентов
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.Период >= &НачалоНедели
		|	И РаботаСКлиентом.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	РаботаСКлиентом.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РаботаСКлиентом.Клиент КАК Клиент,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РаботаСКлиентом.УИД_Записи) КАК КоличествоЗаписейПоКонтрагентуСНачалаДня
		|ПОМЕСТИТЬ ТабРботкКлиентовСНачалаДня
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.Период >= &НачалоДня
		|	И РаботаСКлиентом.АвтоматичнийЗаписБезВзаємодіїЗКлієнтом = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	РаботаСКлиентом.Клиент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТабКОнрагентв.Ссылка КАК Контрагент,
		|	1 КАК КлиентскаяБаза,
		|	ЕСТЬNULL(ТабРботкКлиентов.КоличествоЗаписейПоКонтрагенту, 0) КАК ОбработаноКонтрагентов,
		|	1 КАК ОсталосьОбработать,
		|	ЕСТЬNULL(ТабРботкКлиентовСНачалаДня.КоличествоЗаписейПоКонтрагентуСНачалаДня, 0) КАК ОбработаноКонтрагентовСНачалаДня
		|ИЗ
		|	ТабКОнрагентв КАК ТабКОнрагентв
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабРботкКлиентов КАК ТабРботкКлиентов
		|		ПО ТабКОнрагентв.Ссылка = ТабРботкКлиентов.Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТабРботкКлиентовСНачалаДня КАК ТабРботкКлиентовСНачалаДня
		|		ПО ТабКОнрагентв.Ссылка = ТабРботкКлиентовСНачалаДня.Клиент";
	
	Запрос.УстановитьПараметр("НачалоНедели", НачалоНедели(ТекущаяДата()));
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("Ссылка", СписокКонтрагентов);
	
	ТЗКонтрагентов = Запрос.Выполнить().Выгрузить();
	
	ТЗКонтрагентов.Колонки.Добавить("УИДКонтрагент");
	
	Для Каждого стрКонтрагент ИЗ ТЗКонтрагентов Цикл
		стрКонтрагент.УИДКонтрагент = стрКонтрагент.Контрагент.УникальныйИдентификатор();		
		Если стрКонтрагент.ОбработаноКонтрагентов > 0 Тогда
			стрКонтрагент.ОбработаноКонтрагентов = 1;
			стрКонтрагент.ОсталосьОбработать = 0;
		КонецЕсли; 	
		Если стрКонтрагент.ОбработаноКонтрагентовСНачалаДня > 0 Тогда
			стрКонтрагент.ОбработаноКонтрагентовСНачалаДня = 1;
		КонецЕсли;		
	КонецЦикла;	                                                                         
	
	ТЗКонтрагентов.Колонки.Удалить("Контрагент");
	
	Ответ = Новый Структура;
	Ответ.Вставить("Успех", Истина);
	
	Пароль = Константы.ПарольВхода.Получить();
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("ТЗКонтрагентов", ТЗКонтрагентов);

	Данные = Новый Структура;
	Данные.Вставить("Команда", "ПолучитьАнализКлиентскойБазы");
	Данные.Вставить("Параметры", ПараметрыКоманды);
	
	Попытка 
		Прокси = СоединениеСБазой.ПолучитьПрокси();
		СтруктураОтветаАнализуКилентскойБазы = Прокси.ВыполнитьКоманду(Пароль, Обмен_УправлениеОбменом.Сериализовать(Данные)).Получить();
	Исключение
		СтруктураОтветаАнализуКилентскойБазы = Новый Структура;
		СтруктураОтветаАнализуКилентскойБазы.Вставить("Успешно", Ложь);
		СтруктураОтветаАнализуКилентскойБазы.Вставить("Ошибка", ОписаниеОшибки());
	КонецПопытки;

	Если Не СтруктураОтветаАнализуКилентскойБазы.Успешно Тогда
		Сообщить("Полика запиту до сервера");
		Сообщить(СтруктураОтветаАнализуКилентскойБазы.Ошибка);
		Возврат Неопределено;
	Иначе
		ТабДокумент = СтруктураОтветаАнализуКилентскойБазы.Данные;		
	КонецЕсли;

	Возврат ТабДокумент;
КонецФункции

&НаКлиенте
Процедура АнализКлиентскойБазы(Команда)
	ТабДокумент = ПолучитьАнализКлиентскойБазыНаСервере();
	Если Не ТабДокумент = Неопределено Тогда
		ТабДокумент.Показать("Аналіз клієнтської бази");
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция СписокВКоллекциюЗначений()
	
	//Получаем схема компановки данных (здесь хранится текст запроса)
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	//Получаем настройки пользователя (отборы, сортировки и т.п.)
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Возвращаем полученную таблицу значений
	Возврат  Результат;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьViber(Команда)
	
	
	ViberОбновлениеКлиент.ПолучитьСписокНовыхОповещений();

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьВайбер(Команда)
	
	МассивКонтактов = Новый Массив;
	
	Для Каждого Стр из Элементы.Список.ВыделенныеСтроки Цикл
		МассивКонтактов.Добавить(Стр);
	КонецЦикла;
	
	СтруктураПараметров = Новый Структура("Контрагенты", МассивКонтактов);
	ОткрытьФорму("ОбщаяФорма.ФормаОтправкиСообщенийВайбер", СтруктураПараметров);
		
КонецПроцедуры

&НаКлиенте
Процедура НовыеКонтакты(Команда)
	
	ОткрытьФорму("Справочник.КонтактыViber.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ФільтрТорговыйАгентПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ФільтрТорговыйАгент) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].Использование = Ложь;
	Иначе  
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].ПравоеЗначение	= ФільтрТорговыйАгент;		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокСылокКонтрагентовДляОтбораПоИтории(ФільтрИстория)
	СписокДляОтбора = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РаботаСКлиентом.Клиент КАК Клиент,
		|	РаботаСКлиентом.Запись КАК Запись
		|ИЗ
		|	РегистрСведений.РаботаСКлиентом КАК РаботаСКлиентом
		|ГДЕ
		|	РаботаСКлиентом.Запись ПОДОБНО &Запись";
	
	Запрос.УстановитьПараметр("Запись", "%" + ФільтрИстория + "%");
	
	ТЗРезультатЗапроса = Запрос.Выполнить().Выгрузить();
	СписокДляОтбора.ЗагрузитьЗначения(ТЗРезультатЗапроса.ВыгрузитьКолонку("Клиент"));
	
	Возврат СписокДляОтбора;	
КонецФункции

&НаКлиенте
Процедура ФільтрИсторияПриИзменении(Элемент)
	Если Не ЗначениеЗаполнено(ФільтрИстория) Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование = Ложь;
	Иначе  
		СписокКонтрагентовДляФильтра = ПолучитьСписокСылокКонтрагентовДляОтбораПоИтории(ФільтрИстория);
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ВидСравнения 	= ВидСравненияКомпоновкиДанных.ВСписке;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[3].ПравоеЗначение	= СписокКонтрагентовДляФильтра;		
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ОтборазитьКнопкуНовыеУведомления()Экспорт
	
	СписокНовых = ПолучитьСписокНовыхУведомлений();
	Если СписокНовых > 0 Тогда
		Элементы.НовыеУведомления.Заголовок = "Нові повідомлення (" + СписокНовых + ")";
		Если НЕ ФильтрТолькоНовые Тогда
			Элементы.НовыеУведомления.ЦветФона  = Новый Цвет(191, 255, 194);
		Иначе
			Элементы.НовыеУведомления.ЦветФона  = Новый Цвет(255, 99, 125);
		КонецЕсли;	
	Иначе
		Элементы.НовыеУведомления.Заголовок = "Нові повідомлення";
		Элементы.НовыеУведомления.ЦветФона  = Новый Цвет();
	КонецЕсли;	
	
		
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНовыхУведомлений()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НовоеСообщение.Контакт КАК Контакт
		|ИЗ
		|	РегистрСведений.НовоеСообщение КАК НовоеСообщение
		|ГДЕ
		|	НовоеСообщение.Новое";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса.Количество();	
	
КонецФункции	

&НаКлиенте
Процедура НовыеУведомления(Команда)
	
	Если НЕ ФильтрТолькоНовые Тогда
		ФильтрТолькоНовые = Истина;
	Иначе
		ФильтрТолькоНовые = Ложь;
	КонецЕсли;	
	
	Если НЕ ФильтрТолькоНовые Тогда 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].Использование = Ложь;
		Элементы.НовыеУведомления.ЦветФона  = Новый Цвет();
	Иначе 
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].Использование 	= Истина;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[8].ПравоеЗначение	= Истина;
		Элементы.НовыеУведомления.ЦветФона  = Новый Цвет(255, 99, 125);
	КонецЕсли; 
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФільтрКлючовіСловаАбоПриИзменении(Элемент)
	
	Отбор = Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[10];
	Отбор.ПравоеЗначение = ФільтрКлючовіСлова.Количество();
	Отбор.Использование = ФільтрКлючовіСлова100;

КонецПроцедуры

&НаСервере
Процедура ПошукПоТелефонуНаСервере(Телефон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ТорговыйАгент КАК ТорговыйАгент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.НомерТелефона ПОДОБНО &Телефон";
	
	Запрос.УстановитьПараметр("Телефон", "%" + Прав(Телефон, 10) + "%");
	
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если  Выборка.Следующий() Тогда 
		Отказ = истина;
		Сообщить("" + Выборка.Ссылка + " відповідальний "  + Выборка.ТорговыйАгент); 
	КонецЕсли;	
	
	
	Если Отказ = истина 
		Или Телефон = "" Тогда 
		Возврат;
	КонецЕсли;
	
	Ответ = Общий.ПоискДублейНомеровТелефона_НаСервере1С(Прав(Телефон, 10), Справочники.Контрагенты.ПустаяСсылка(), Истина);
	
	Если Ответ.Успешно Тогда 
		Если Ответ.Данные.ЕстьДубли Тогда 
			Отказ = истина;
			Сообщить(Ответ.Данные.ТекстОшибки);
		КонецЕсли;
		
		
		Возврат; 
	Иначе
		Сообщить("Контроль унікальності контрагента виконано лише в додатку. Не має підключення до 1С!");
	КонецЕсли;
	

КонецПроцедуры

&НаКлиенте
Процедура ПошукПоТелефону(Команда)
	Телефон = "";
	Если Не ВвестиСтроку(Телефон, "Номер телефону") Тогда 
		Возврат;
	КонецЕсли;
	
	ПошукПоТелефонуНаСервере(Телефон);
КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
//	
//	#Если НЕ МобильноеПриложениеКлиент Тогда
//		Для Каждого ГрЭл Из Элементы.ГрупиКолонокДесктоп.ПодчиненныеЭлементы Цикл 
//			Для Каждого Эл Из ГрЭл.ПодчиненныеЭлементы Цикл      
//				Если Эл.вид <> ВидПоляФормы.ПолеФлажка Тогда 
//					СохранитьЗначениеНастроек("ДесктопШирина" + Эл.Имя, Эл.Ширина);  
//				КонецЕсли;
//			КонецЦикла;
//		КонецЦикла;
//	#КонецЕсли

//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ВосстановитьЗначениеНастроек(ИмяНастройки)
//	з = Новый Запрос;
//	з.Текст = "ВЫБРАТЬ
//	          |	НастройкиПользователя.Значение КАК Значение
//	          |ИЗ
//	          |	РегистрСведений.НастройкиПользователя КАК НастройкиПользователя
//	          |ГДЕ
//	          |	НастройкиПользователя.ИмяНастройки = &ИмяНастройки";
//	з.УстановитьПараметр("ИмяНастройки", ИмяНастройки);
//	Выборка = з.Выполнить().Выбрать();
//	Если Выборка.Следующий() Тогда 
//		Возврат Выборка.Значение;
//	Иначе 
//		Возврат Неопределено;
//	КонецЕсли;
//	
//КонецФункции

//&НаСервереБезКонтекста
//Функция СохранитьЗначениеНастроек(ИмяНастройки, Значение)
//	нз = РегистрыСведений.НастройкиПользователя.СоздатьНаборЗаписей();
//	нз.Отбор.ИмяНастройки.Установить(ИмяНастройки);
//	зап = нз.Добавить();
//	зап.ИмяНастройки = ИмяНастройки;
//	зап.Значение =  Значение;
//	нз.Записать();
//	
//КонецФункции

//&НаСервереБезКонтекста
//Функция СброситьЗначенияНастроек()
//	нз = РегистрыСведений.НастройкиПользователя.СоздатьНаборЗаписей();
//	нз.Записать();
//КонецФункции

//&НаКлиенте
//Процедура СброситьНастройкиКолонок(Команда)
//	СброситьЗначенияНастроек();
//КонецПроцедуры
